stm32duino/Arduino_Core_STM32/cores/arduino/stm32/timer.c
  sConfig.OCMode        = TIM_OCMODE_TIMING;
  sConfig.Pulse         = pulseWidth;
  sConfig.OCPolarity    = TIM_OCPOLARITY_HIGH;
  sConfig.OCFastMode    = TIM_OCFAST_DISABLE;
#if !defined(STM32L0xx) && !defined(STM32L1xx)
  sConfig.OCNPolarity   = TIM_OCNPOLARITY_HIGH;
  sConfig.OCIdleState   = TIM_OCIDLESTATE_RESET;
  sConfig.OCNIdleState  = TIM_OCNIDLESTATE_RESET;
#endif
  HAL_NVIC_SetPriority(getTimerIrq(obj->timer), TIM_IRQ_PRIO, TIM_IRQ_SUBPRIO);
  HAL_NVIC_EnableIRQ(getTimerIrq(obj->timer));

  if (HAL_TIM_OC_Init(handle) != HAL_OK) {
    return;
  }
  switch (timChannel) {
    case TIM_CHANNEL_1:
      obj->irqHandleOC_CH1 = irqHandle;
      if (HAL_TIM_OC_ConfigChannel(handle, &sConfig, TIM_CHANNEL_1) == HAL_OK) {
        HAL_TIM_OC_Start_IT(handle, TIM_CHANNEL_1);
      }
      break;
    case TIM_CHANNEL_2:
      obj->irqHandleOC_CH2 = irqHandle;
      if (HAL_TIM_OC_ConfigChannel(handle, &sConfig, TIM_CHANNEL_2) == HAL_OK) {
        HAL_TIM_OC_Start_IT(handle, TIM_CHANNEL_2);
      }
      break;
    case TIM_CHANNEL_3:
      obj->irqHandleOC_CH3 = irqHandle;
      if (HAL_TIM_OC_ConfigChannel(handle, &sConfig, TIM_CHANNEL_3) == HAL_OK) {
        HAL_TIM_OC_Start_IT(handle, TIM_CHANNEL_3);
      }
      break;
    case TIM_CHANNEL_4:
      obj->irqHandleOC_CH4 = irqHandle;
      if (HAL_TIM_OC_ConfigChannel(handle, &sConfig, TIM_CHANNEL_4) == HAL_OK) {
        HAL_TIM_OC_Start_IT(handle, TIM_CHANNEL_4);
      }
      break;
    default:
      break;
  }
  return;
}

/******************************************************************************/
/*                            TIMx IRQ HANDLER                                */
/******************************************************************************/

#if defined(TIM1_BASE)
/**
  * @brief  TIM1 IRQHandler common with TIM10 and TIM16 on some STM32F1xx
  * @param  None
  * @retval None
  */
void TIM1_IRQHandler(void)
{
  if (timer_handles[TIMER1_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER1_INDEX]);
  }

#if defined(STM32F1xx) || defined(STM32F2xx) || defined(STM32F4xx) || defined(STM32F7xx)
#if defined (TIM10_BASE)
  if (timer_handles[TIMER10_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER10_INDEX]);
  }
#endif
#endif

#if defined(STM32F1xx) || defined(STM32F3xx) || defined(STM32G4xx) || defined(STM32L4xx) || \
    defined(STM32WBxx)
#if defined (TIM16_BASE)
  if (timer_handles[TIMER16_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER16_INDEX]);
  }
#endif
#endif
}
#endif //TIM1_BASE

#if defined(TIM2_BASE)
/**
  * @brief  TIM2 IRQHandler
  * @param  None
  * @retval None
  */
void TIM2_IRQHandler(void)
{
  if (timer_handles[TIMER2_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER2_INDEX]);
  }
}
#endif //TIM2_BASE

#if defined(TIM3_BASE)
/**
  * @brief  TIM3 IRQHandler
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  if (timer_handles[TIMER3_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER3_INDEX]);
  }
}
#endif //TIM3_BASE

#if defined(TIM4_BASE)
/**
  * @brief  TIM4 IRQHandler
  * @param  None
  * @retval None
  */
void TIM4_IRQHandler(void)
{
  if (timer_handles[TIMER4_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER4_INDEX]);
  }
}
#endif //TIM4_BASE

#if defined(TIM5_BASE)
/**
  * @brief  TIM5 IRQHandler
  * @param  None
  * @retval None
  */
void TIM5_IRQHandler(void)
{
  if (timer_handles[TIMER5_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER5_INDEX]);
  }
}
#endif //TIM5_BASE

#if defined(TIM6_BASE)
/**
  * @brief  TIM6 IRQHandler
  * @param  None
  * @retval None
  */
void TIM6_IRQHandler(void)
{
  if (timer_handles[TIMER6_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER6_INDEX]);
  }
}
#endif //TIM6_BASE

#if defined(TIM7_BASE)
/**
  * @brief  TIM7 IRQHandler
  * @param  None
  * @retval None
  */
void TIM7_IRQHandler(void)
{
  if (timer_handles[TIMER7_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER7_INDEX]);
  }
}
#endif //TIM7_BASE

#if defined(TIM8_BASE)
/**
  * @brief  TIM8 IRQHandler
  * @param  None
  * @retval None
  */
void TIM8_IRQHandler(void)
{
  if (timer_handles[TIMER8_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER8_INDEX]);
  }

#if defined(STM32F1xx) || defined(STM32F2xx) ||defined(STM32F4xx) || defined(STM32F7xx)
  if (timer_handles[TIMER13_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER13_INDEX]);
  }
#endif
}
#endif //TIM8_BASE

#if defined(TIM9_BASE)
/**
  * @brief  TIM9 IRQHandler
  * @param  None
  * @retval None
  */
void TIM9_IRQHandler(void)
{
  if (timer_handles[TIMER9_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER9_INDEX]);
  }
}
#endif //TIM9_BASE

#if defined(TIM10_BASE)
#if !defined(STM32F1xx) && !defined(STM32F2xx) && !defined(STM32F4xx) && !defined(STM32F7xx)
/**
  * @brief  TIM10 IRQHandler
  * @param  None
  * @retval None
  */
void TIM10_IRQHandler(void)
{
  if (timer_handles[TIMER10_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER10_INDEX]);
  }
}
#endif
#endif //TIM10_BASE

#if defined(TIM11_BASE)
/**
  * @brief  TIM11 IRQHandler
  * @param  None
  * @retval None
  */
void TIM11_IRQHandler(void)
{
  if (timer_handles[TIMER11_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER11_INDEX]);
  }
}
#endif //TIM11_BASE

#if defined(TIM12_BASE)
/**
  * @brief  TIM12 IRQHandler
  * @param  None
  * @retval None
  */
void TIM12_IRQHandler(void)
{
  if (timer_handles[TIMER12_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER12_INDEX]);
  }
}
#endif //TIM12_BASE

#if defined(TIM13_BASE)
#if !defined(STM32F1xx) && !defined(STM32F2xx) && !defined(STM32F4xx) && !defined(STM32F7xx)
/**
  * @brief  TIM13 IRQHandler
  * @param  None
  * @retval None
  */
void TIM13_IRQHandler(void)
{
  if (timer_handles[TIMER13_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER13_INDEX]);
  }
}
#endif
#endif //TIM13_BASE

#if defined(TIM14_BASE)
/**
  * @brief  TIM14 IRQHandler
  * @param  None
  * @retval None
  */
void TIM14_IRQHandler(void)
{
  if (timer_handles[TIMER14_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER14_INDEX]);
  }
}
#endif //TIM14_BASE

#if defined(TIM15_BASE)
/**
  * @brief  TIM15 IRQHandler
  * @param  None
  * @retval None
  */
void TIM15_IRQHandler(void)
{
  if (timer_handles[TIMER15_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER15_INDEX]);
  }
}
#endif //TIM15_BASE

#if defined(TIM16_BASE)
#if !defined(STM32F1xx) && !defined(STM32F3xx) && !defined(STM32G4xx) && !defined(STM32L4xx)
/**
  * @brief  TIM16 IRQHandler
  * @param  None
  * @retval None
  */
void TIM16_IRQHandler(void)
{
  if (timer_handles[TIMER16_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER16_INDEX]);
  }
}
#endif
#endif //TIM16_BASE

#if defined(TIM17_BASE)
/**
  * @brief  TIM17 IRQHandler
  * @param  None
  * @retval None
  */
void TIM17_IRQHandler(void)
{
  if (timer_handles[TIMER17_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER17_INDEX]);
  }
}
#endif //TIM17_BASE

#if defined(TIM18_BASE)
/**
  * @brief  TIM18 IRQHandler
  * @param  None
  * @retval None
  */
void TIM18_IRQHandler(void)
{
  if (timer_handles[TIMER18_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER18_INDEX]);
  }
}
#endif //TIM18_BASE

#if defined(TIM19_BASE)
/**
  * @brief  TIM19 IRQHandler
  * @param  None
  * @retval None
  */
void TIM19_IRQHandler(void)
{
  if (timer_handles[TIMER19_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER19_INDEX]);
  }
}
#endif //TIM19_BASE

#if defined(TIM20_BASE)
/**
  * @brief  TIM20 IRQHandler
  * @param  None
  * @retval None
  */
void TIM20_IRQHandler(void)
{
  if (timer_handles[TIMER20_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER20_INDEX]);
  }
}
#endif //TIM20_BASE

#if defined(TIM21_BASE)
/**
  * @brief  TIM21 IRQHandler
  * @param  None
  * @retval None
  */
void TIM21_IRQHandler(void)
{
  if (timer_handles[TIMER21_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER21_INDEX]);
  }
}
#endif //TIM21_BASE

#if defined(TIM22_BASE)
/**
  * @brief  TIM22 IRQHandler
  * @param  None
  * @retval None
  */
void TIM22_IRQHandler(void)
{
  if (timer_handles[TIMER22_INDEX] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[TIMER22_INDEX]);
  }
}
#endif //TIM22_BASE
#endif /* HAL_TIM_MODULE_ENABLED */

#ifdef __cplusplus
}
#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
